In [1]:
import sys; sys.path.insert(0, "../")
import pandas as pd

from clean.new_orleans_csd import clean_personel_2014, clean_personel_2009
from lib.match_records import match_records, show_similar_rows

In [2]:
df14 = clean_personel_2014()
df14

,Department,Last Name,First Name,Birth Date,Hire Date,Rank Number #,Rank,Termination Date,Pay Prog Start Date,Annual Salary
0,MANAGEMNT SERVICES BUREAU,Moore,Charmaine,1901-01-01,1996-02-08,C0025,CLERICAL SPECIALIST,1996-08-28,1996-08-28,11235.83
1,MANAGEMNT SERVICES BUREAU,Coxen,Shanna,1972-10-05,1996-09-22,C5201,LABORATORY TECHNICIAN 1,1997-01-01,1997-01-01,14951.72
2,SPECIAL INVESTIGATION DIV,Cavalieresr,Morris,1947-07-21,1970-12-21,C7134,POLICE OFFICER 4,1997-01-04,1997-01-04,29243.06
3,FIRST DISTRICT,Fonseca,Norbert,1943-08-31,1967-08-21,C7112,POLICE LIEUTENANT,1997-01-04,1997-01-04,39893.17
4,FIFTH DISTRICT,Hartman,Steven,1964-03-11,1985-02-10,C7112,POLICE LIEUTENANT,1997-01-04,1997-01-04,33524.95
...,...,...,...,...,...,...,...,...,...,...
3681,MANAGEMNT SERVICES BUREAU,Johnson,Shawn,1990-06-23,2014-08-17,C7105,POLICE AIDE,2014-12-10,2014-08-17,28882.03
3682,SIXTH DISTRICT,Linehan,Henry,1982-08-18,2009-12-27,C7110,POLICE OFFICER 1,2014-12-11,2011-03-13,37490.69
3683,FIRST DISTRICT,Finneman,David,1960-12-20,2001-09-16,C7111,POLICE SERGEANT,2014-12-13,2013-01-30,50513.12
3684,MANAGEMNT SERVICES BUREAU,Badr,Mohamed,1980-10-06,2014-08-31,C7105,POLICE AIDE,2014-12-20,2014-08-31,28882.03
3685,MANAGEMNT SERVICES BUREAU,Patrick,Carol,1974-10-23,2014-08-17,C7105,POLICE AIDE,2014-12-30,2014-08-17,28882.03

In [3]:
df09 = clean_personel_2009()
df09.rename(columns={"Pay Prog Start Date": "Hire Date"}, inplace=True)
df09.loc[:, "First Name"].fillna("")
df09

,Department,First Name,Last Name,Rank Number #,Rank,Termination Date,Hire Date,Annual Salary
0,FISCAL MANAGEMENT,Christopher,Abbott,C7134,POLICE OFFICER 4,,1992-02-09,46885.01
1,TRAFFIC,David,Abbott,C7134,POLICE OFFICER 4,,1987-11-01,48064.46
2,POLICE RECRUITS,Shelton,Abram,C7109,POLICE RECRUIT ACADEMY,,2009-09-06,34797.91
3,FISCAL MANAGEMENT,James,Adams,C7133,POLICE OFFICER 3,2009-08-30,1987-09-06,45734.50
4,PUBLIC INTEGRITY,Bruce,Adams,U0018,ASSISTANT SUPT OF POLICE,,1975-10-16,106440.30
...,...,...,...,...,...,...,...,...
1976,POLICE RECRUITS,Jeffrey,Yount,NaN,POLICE RECRUIT ACADEMY,,,34797.91
1977,TECHNICIAL SERVICES BUREA,Sara,Zaldivar,NaN,POLICE COMPLAINT OPERATOR,,,25508.06
1978,SIXTH DISTRICT,Daniel,Zapico,NaN,POLICE OFFICER 1,,,36570.71
1979,THIRD DISTRICT,Ron,Zoller,NaN,POLICE OFFICER 4,,,44612.22
1980,PUBLIC INTEGRITY,Walter,Zschiedrich,NaN,POLICE SERGEANT,,,63170.56

In [10]:
# names = set(df09[["First Name", "Last Name"]].fillna("").agg(", ".join, axis=1).tolist())
# names14 = set(df14[["First Name", "Last Name"]].fillna("").agg(", ".join, axis=1).tolist())
# len(names.intersection(names14))
# df14[(df14["First Name"] == "James") & (df14["Last Name"] == "Adams")]
match_records(df14, df09[~df09["First Name"].isna()], ["First Name", "Last Name", "Hire Date"])

239 exact match
605 not found
9 suspects (Levenshtein distance <= 2)
suspect cases are:
                                     a                                   b  dist
0              Don, Cotton, 1985-06-02             Don, Cotton, 1989-07-02     2
1          Rochelle, Darby, 2009-03-15         Rochelle, Darby, 2009-03-16     1
2  Joshua, Fahrenholt-Hunt, 2006-11-26  Joshua, Fahrenholt-Hun, 2006-11-26     1
3             Ashely, Ford, 2009-07-19            Ashley, Ford, 2009-07-19     2
4            Denise, Klemm, 1979-05-06           Denise, Klemm, 1979-09-16     2
5      Louis, Richardsonjr, 1990-11-21     Louis, Richardsonjr, 1990-01-21     1
6     Maria, Villavicencio, 2008-10-26     Maria, Villavicecio, 2008-10-26     1
7       Sterling, Williams, 1981-08-16    Sterling, Williamsjr, 1981-08-16     2
8      Pauline, Willoughby, 1985-02-24     Pauline, Willoughby, 1988-01-24     2

(0           James, Adams, 1987-09-06
 1       Hillery, Addison, 2004-06-20
 2           Joyce, Ahmed, 1978-01-04
 3        Carol, Aldridge, 1984-08-19
 4      Tiwana, Alexander, 2003-11-23
                    ...
 234        Terry, Wilson, 1984-05-13
 235         Aaron, Wiltz, 2004-04-25
 236       Byron, Winbush, 1982-10-03
 237     Leander, Winford, 2002-11-17
 238        Jeffrey, Winn, 1985-05-26
 Length: 239, dtype: object,
                                      a                                   b  \
 0              Don, Cotton, 1985-06-02             Don, Cotton, 1989-07-02
 1          Rochelle, Darby, 2009-03-15         Rochelle, Darby, 2009-03-16
 2  Joshua, Fahrenholt-Hunt, 2006-11-26  Joshua, Fahrenholt-Hun, 2006-11-26
 3             Ashely, Ford, 2009-07-19            Ashley, Ford, 2009-07-19
 4            Denise, Klemm, 1979-05-06           Denise, Klemm, 1979-09-16
 5      Louis, Richardsonjr, 1990-11-21     Louis, Richardsonjr, 1990-01-21
 6     Maria, Villavicencio, 2008-10-26     Maria, Villavicecio, 2008-10-26
 7       Sterling, Williams, 1981-08-16    Sterling, Williamsjr, 1981-08-16
 8      Pauline, Willoughby, 1985-02-24     Pauline, Willoughby, 1988-01-24

    dist
 0     2
 1     1
 2     1
 3     2
 4     2
 5     1
 6     1
 7     2
 8     2  ,
 0      Christopher, Abbott, 1992-02-09
 1            David, Abbott, 1987-11-01
 2           Shelton, Abram, 2009-09-06
 3             Bruce, Adams, 1975-10-16
 4             Larry, Adams, 2008-12-14
                     ...
 600                   Jeffrey, Yount,
 601                   Sara, Zaldivar,
 602                   Daniel, Zapico,
 603                      Ron, Zoller,
 604              Walter, Zschiedrich,
 Length: 605, dtype: object)

In [11]:
match_records(df14, df09[df09["First Name"].isna()], ["Last Name", "Hire Date", "Rank Number #"])

93 exact match
961 not found
27 suspects (Levenshtein distance <= 2)
suspect cases are:
                               a                             b  dist
0         Ard, 2009-09-06, C7108        Ard, 2009-09-06, C7109     1
1      Austin, 1985-07-28, C7112     Austin, 1985-07-28, C7134     2
2    Bagneris, 2001-06-24, C7111   Bagneris, 2001-06-24, C7134     2
3        Byrd, 2008-09-14, C7142       Byrd, 2008-09-14, C7141     1
4    Caldwell, 2005-03-06, C7132   Caldwell, 2005-03-06, C7110     2
5    Caminita, 2009-01-04, C7133   Caminita, 2009-01-04, C7110     2
6   Duronslet, 2008-08-17, C7105  Duronslet, 2008-08-24, C7105     2
7       Elder, 1975-03-31, C7113      Elder, 1975-03-31, C7122     2
8        Gray, 1976-09-13, C7112       Gray, 1976-09-13, C7111     1
9     Guesnon, 2003-05-18, C7134    Guesnon, 2003-05-18, C7133     1
10       Hart, 1997-10-05, C7112       Hart, 1997-10-05, C7111     1
11     Haynes, 2008-07-13, C7142     Haynes, 2008-07-13, C7141     1
12     Hebert, 2009-05-24, C7133     Hebert, 2009-05-24, C7108     2
13  Henderson, 2009-01-04, C7110  Henderson, 2009-01-04, C7108     2
14    Jackson, 2004-12-26, C7108    Jackson, 2004-12-26, C7132     2
15     Jacobs, 1978-07-10, C7104     Jacobs, 1978-07-10, C7103     1
16    Johnson, 2008-11-09, C7110    Johnson, 2007-11-04, C7110     2
17    Johnson, 2000-05-15, C7132    Johnson, 2004-02-15, C7132     2
18    Johnson, 2005-03-27, C7110    Johnson, 2008-03-23, C7110     2
19      Jones, 2008-04-06, C7133      Jones, 2008-04-06, C7110     2
20      Jones, 2007-01-21, C7132      Jones, 2007-01-21, C7110     2
21      Moses, 2007-01-21, C7110      Jones, 2007-01-21, C7110     2
22      Jones, 2002-10-27, C7134      Jones, 2002-10-27, C7133     1
23    Ostarly, 2009-06-07, C7133    Ostarly, 2009-06-07, C7108     2
24    Painter, 2009-08-23, C7108    Painter, 2009-08-23, C7109     1
25      Patin, 2004-12-05, C7133      Patin, 2004-12-05, C7132     1
26   Patrolia, 1977-06-22, C7134   Patrolia, 1978-06-25, C7134     2

(0     Anderson, 1984-01-15, C7111
 1        Andry, 1985-06-02, C7111
 2       Aponte, 2009-01-11, C7110
 3         Arey, 1994-05-01, C0363
 4      Arnolie, 2009-03-08, C7108
                  ...
 88      Pallez, 2002-10-13, C7109
 89      Palmer, 1984-01-15, C7134
 90      Parker, 1977-10-10, C7134
 91      Parker, 2009-07-19, C7101
 92    Parkerjr, 1983-01-23, C7134
 Length: 93, dtype: object,
                                a                             b  dist
 0         Ard, 2009-09-06, C7108        Ard, 2009-09-06, C7109     1
 1      Austin, 1985-07-28, C7112     Austin, 1985-07-28, C7134     2
 2    Bagneris, 2001-06-24, C7111   Bagneris, 2001-06-24, C7134     2
 3        Byrd, 2008-09-14, C7142       Byrd, 2008-09-14, C7141     1
 4    Caldwell, 2005-03-06, C7132   Caldwell, 2005-03-06, C7110     2
 5    Caminita, 2009-01-04, C7133   Caminita, 2009-01-04, C7110     2
 6   Duronslet, 2008-08-17, C7105  Duronslet, 2008-08-24, C7105     2
 7       Elder, 1975-03-31, C7113      Elder, 1975-03-31, C7122     2
 8        Gray, 1976-09-13, C7112       Gray, 1976-09-13, C7111     1
 9     Guesnon, 2003-05-18, C7134    Guesnon, 2003-05-18, C7133     1
 10       Hart, 1997-10-05, C7112       Hart, 1997-10-05, C7111     1
 11     Haynes, 2008-07-13, C7142     Haynes, 2008-07-13, C7141     1
 12     Hebert, 2009-05-24, C7133     Hebert, 2009-05-24, C7108     2
 13  Henderson, 2009-01-04, C7110  Henderson, 2009-01-04, C7108     2
 14    Jackson, 2004-12-26, C7108    Jackson, 2004-12-26, C7132     2
 15     Jacobs, 1978-07-10, C7104     Jacobs, 1978-07-10, C7103     1
 16    Johnson, 2008-11-09, C7110    Johnson, 2007-11-04, C7110     2
 17    Johnson, 2000-05-15, C7132    Johnson, 2004-02-15, C7132     2
 18    Johnson, 2005-03-27, C7110    Johnson, 2008-03-23, C7110     2
 19      Jones, 2008-04-06, C7133      Jones, 2008-04-06, C7110     2
 20      Jones, 2007-01-21, C7132      Jones, 2007-01-21, C7110     2
 21      Moses, 2007-01-21, C7110      Jones, 2007-01-21, C7110     2
 22      Jones, 2002-10-27, C7134      Jones, 2002-10-27, C7133     1
 23    Ostarly, 2009-06-07, C7133    Ostarly, 2009-06-07, C7108     2
 24    Painter, 2009-08-23, C7108    Painter, 2009-08-23, C7109     1
 25      Patin, 2004-12-05, C7133      Patin, 2004-12-05, C7132     1
 26   Patrolia, 1977-06-22, C7134   Patrolia, 1978-06-25, C7134     2,
 0      Anderson, 2008-12-21, C7109
 1      Anderson, 1997-05-04, C7111
 2      Anderson, 2008-01-20, C7110
 3      Anderson, 1997-10-26, C7142
 4      Anderson, 2003-03-16, C7142
                   ...
 956         Watts, 2009-10-25, nan
 957        Watzke, 1985-06-23, nan
 958           Wax, 1998-04-12, nan
 959    Weathersby, 1985-02-24, nan
 960    Weathersby, 2007-09-23, nan
 Length: 961, dtype: object)

In [7]:
df09[df09["First Name"].isna()]

,Department,First Name,Last Name,Rank Number #,Rank,Termination Date,Hire Date,Annual Salary
36,FISCAL MANAGEMENT,NaN,Anderson,C7111,POLICE SERGEANT,,1984-01-15,54421.98
37,POLICE RECRUITS,NaN,Anderson,C7109,POLICE RECRUIT ACADEMY,,2008-12-21,34797.91
38,FIRST DISTRICT,NaN,Anderson,C7111,POLICE SERGEANT,,1997-05-04,50513.12
39,FOURTH DISTRICT,NaN,Anderson,C7110,POLICE OFFICER 1,,2008-01-20,37490.69
40,TECHNICIAL SERVICES BUREA,NaN,Anderson,C7142,POLICE TECHNICIAN 2,,1997-10-26,23094.96
...,...,...,...,...,...,...,...,...
1871,TECHNICIAL SERVICES BUREA,NaN,Watts,NaN,POLICE COMPLAINT OPERATOR,,2009-10-25,25508.06
1872,TECHNICIAL SERVICES BUREA,NaN,Watzke,NaN,POLICE SERGEANT,,1985-06-23,53086.52
1873,FOURTH DISTRICT,NaN,Wax,NaN,POLICE SERGEANT,,1998-04-12,50513.12
1874,TECHNICIAL SERVICES BUREA,NaN,Weathersby,NaN,ASSISTANT SUPT OF POLICE,,1985-02-24,89449.03
1875,FIFTH DISTRICT,NaN,Weathersby,NaN,POLICE OFFICER 1,,2007-09-23,37490.69

In [25]:
df14[~df14["Department"].str.match(r"^POL .+")]

Empty DataFrame
Columns: [Department, Last Name, First Name, Birth Date, Hire Date, Rank Number #, Rank, Termination Date, Pay Prog Start Date, Annual Salary]
Index: []

In [23]:
df09["Department"].unique()

array(['FISCAL MANAGEMENT', 'TRAFFIC', 'POLICE RECRUITS',
       'PUBLIC INTEGRITY', 'EIGHTH DISTRICT', 'FIFTH  DISTRICT',
       'SPECIAL OPERATIONS', 'THIRD  DISTRICT', 'SIXTH  DISTRICT',
       'FOURTH DISTRICT', 'TECHNICIAL SERVICES BUREA',
       'OFF OF THE SUPERINTENDENT', 'MANAGEMENT SERVICES BUREAU',
       'FIRST DISTRICT', 'CRIMINAL INVESTIGATION BUREAU',
       'SECOND DISTRICT', 'NARCOTICS', 'SEVENTH DISTRICT',
       'SCHOOL CROSSING GUARDS', 'ADMINISTRATIVE-SIB', 'CRIME LAB',
       'C.O.P.S. AHEAD', 'FIELD OPERATIONS', 'OPERATION SAFE HOME',
       'TRANSIT SECURITY', 'QUALITY OF LIFE OFFICERS',
       'CRISIS TRAUMA CENTER'], dtype=object)

In [37]:
import datetime
from lib.excel import remove_unnamed_cols

def convert_date(s):
    if len(s) > 0:
        m, d, y = s.split("/")
        return datetime.date(int(y), int(m), int(d))
    return s

df1 = pd.read_csv(
    "../data/New Orleans Civil Service Department/Administrative Data/New-Orleans_CSD_PPRR_2009.csv")
df1 = remove_unnamed_cols(df1)
df1.loc[:, "TERM DATE"] = df1["TERM DATE"].fillna("").map(convert_date)
df1.loc[:, "PAY PROG START DATE"] = df1["PAY PROG START DATE"].fillna("").map(convert_date)
df1

,ORGN DESC,LAST NAME,FIRST NAME,TITL E CODE,TITLE DESC,TERM DATE,PAY PROG START DATE,ANNUAL SALARY
0,FISCAL MANAGEMENT,ABBOTT,CHRISTOPHER,C7134,POLICE OFFICER 4,,1992-02-09,"$46,885.0056"
1,TRAFFIC,ABBOTT,DAVID,C7134,POLICE OFFICER 4,,1987-11-01,"$48,064.4565"
2,POLICE RECRUITS,ABRAM,SHELTON,C7109,POLICE RECRUIT ACADEMY,,2009-09-06,"$34,797.9137"
3,FISCAL MANAGEMENT,ADAMS,JAMES,C7133,POLICE OFFICER 3,2009-08-30,1987-09-06,"$45,734.4971"
4,PUBLIC INTEGRITY,ADAMS,BRUCE,U0018,ASSISTANT SUPT OF POLICE,,1975-10-16,"$106,440.2966"
...,...,...,...,...,...,...,...,...
1976,POLICE RECRUITS,YOUNT,JEFFREY,NaN,POLICE RECRUIT ACADEMY,,,"$34,797.9137"
1977,TECHNICIAL SERVICES BUREA,ZALDIVAR,SARA,NaN,POLICE COMPLAINT OPERATOR,,,"$25,508.0588"
1978,SIXTH DISTRICT,ZAPICO,DANIEL,NaN,POLICE OFFICER 1,,,"$36,570.7051"
1979,THIRD DISTRICT,ZOLLER,RON,NaN,POLICE OFFICER 4,,,"$44,612.2209"
1980,PUBLIC INTEGRITY,ZSCHIEDRICH,WALTER,NaN,POLICE SERGEANT,,,"$63,170.5615"

In [20]:
df1["Termination Date"]

0      1996-08-28
1      1997-01-01
2      1997-01-04
3      1997-01-04
4      1997-01-04
          ...
3681   2014-12-10
3682   2014-12-11
3683   2014-12-13
3684   2014-12-20
3685   2014-12-30
Name: Termination Date, Length: 3686, dtype: datetime64[ns]